STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE_Thread/Ble_Thread_Dyn_SED_FreeRTOS/STM32_WPAN/App/app_ble.c
#if (P2P_SERVER4 != 0)
static const char local_name[] = { AD_TYPE_COMPLETE_LOCAL_NAME, 'P', '2', 'P', 'S', 'R', 'V', '4'};
uint8_t manuf_data[14] = {
    sizeof(manuf_data)-1, AD_TYPE_MANUFACTURER_SPECIFIC_DATA, 
    0x01/*SKD version */,
    CFG_DEV_ID_P2P_SERVER4 /* STM32WB - P2P Server 4*/,
    0x00 /* GROUP A Feature  */, 
    0x00 /* GROUP A Feature */,
    0x00 /* GROUP B Feature */,
    0x00 /* GROUP B Feature */,
    0x00, /* BLE MAC start -MSB */
    0x00,
    0x00,
    0x00,
    0x00,
    0x00, /* BLE MAC stop */
};
#endif

#if (P2P_SERVER5 != 0)
static const char local_name[] = { AD_TYPE_COMPLETE_LOCAL_NAME, 'P', '2', 'P', 'S', 'R', 'V', '5'};
uint8_t manuf_data[14] = {
    sizeof(manuf_data)-1, AD_TYPE_MANUFACTURER_SPECIFIC_DATA, 
    0x01/*SKD version */,
    CFG_DEV_ID_P2P_SERVER5 /* STM32WB - P2P Server 5*/,
    0x00 /* GROUP A Feature  */, 
    0x00 /* GROUP A Feature */,
    0x00 /* GROUP B Feature */,
    0x00 /* GROUP B Feature */,
    0x00, /* BLE MAC start -MSB */
    0x00,
    0x00,
    0x00,
    0x00,
    0x00, /* BLE MAC stop */
};
#endif

#if (P2P_SERVER6 != 0)
static const char local_name[] = { AD_TYPE_COMPLETE_LOCAL_NAME, 'P', '2', 'P', 'S', 'R', 'V', '6'};
uint8_t manuf_data[14] = {
    sizeof(manuf_data)-1, AD_TYPE_MANUFACTURER_SPECIFIC_DATA, 
    0x01/*SKD version */,
    CFG_DEV_ID_P2P_SERVER6 /* STM32WB - P2P Server 1*/,
    0x00 /* GROUP A Feature  */, 
    0x00 /* GROUP A Feature */,
    0x00 /* GROUP B Feature */,
    0x00 /* GROUP B Feature */,
    0x00, /* BLE MAC start -MSB */
    0x00,
    0x00,
    0x00,
    0x00,
    0x00, /* BLE MAC stop */
};
#endif

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Global variables ----------------------------------------------------------*/
osMutexId_t MtxHciId;
osSemaphoreId_t SemHciId;
osThreadId_t AdvCancelProcessId;
osThreadId_t HciUserEvtProcessId;
#if(L2CAP_REQUEST_NEW_CONN_PARAM != 0)
osThreadId_t ConnIntUpdateReqProcessId;
#endif

const osThreadAttr_t AdvCancelProcess_attr = {
  .name         = CFG_ADV_CANCEL_PROCESS_NAME,
  .attr_bits    = CFG_ADV_CANCEL_PROCESS_ATTR_BITS,
  .cb_mem       = CFG_ADV_CANCEL_PROCESS_CB_MEM,
  .cb_size      = CFG_ADV_CANCEL_PROCESS_CB_SIZE,
  .stack_mem    = CFG_ADV_CANCEL_PROCESS_STACK_MEM,
  .priority     = CFG_ADV_CANCEL_PROCESS_PRIORITY,
  .stack_size   = CFG_ADV_CANCEL_PROCESS_STACK_SIZE
};

const osThreadAttr_t HciUserEvtProcess_attr = {
  .name         = CFG_HCI_USER_EVT_PROCESS_NAME,
  .attr_bits    = CFG_HCI_USER_EVT_PROCESS_ATTR_BITS,
  .cb_mem       = CFG_HCI_USER_EVT_PROCESS_CB_MEM,
  .cb_size      = CFG_HCI_USER_EVT_PROCESS_CB_SIZE,
  .stack_mem    = CFG_HCI_USER_EVT_PROCESS_STACK_MEM,
  .priority     = CFG_HCI_USER_EVT_PROCESS_PRIORITY,
  .stack_size   = CFG_HCI_USER_EVT_PROCESS_STACK_SIZE
};

#if(L2CAP_REQUEST_NEW_CONN_PARAM != 0) 
const osThreadAttr_t ConnIntUpdateReqProcess_attr = {
  .name         = CFG_CONN_INT_UPD_REQ_PROCESS_NAME,
  .attr_bits    = CFG_CONN_INT_UPD_REQ_PROCESS_ATTR_BITS,
  .cb_mem       = CFG_CONN_INT_UPD_REQ_PROCESS_CB_MEM,
  .cb_size      = CFG_CONN_INT_UPD_REQ_PROCESS_CB_SIZE,
  .stack_mem    = CFG_CONN_INT_UPD_REQ_PROCESS_STACK_MEM,
  .priority     = CFG_CONN_INT_UPD_REQ_PROCESS_PRIORITY,
  .stack_size   = CFG_CONN_INT_UPD_REQ_PROCESS_STACK_SIZE
};
#endif

/* Private function prototypes -----------------------------------------------*/
static void BLE_UserEvtRx( void * pPayload );
static void BLE_StatusNot( HCI_TL_CmdStatus_t status );
static void Ble_Tl_Init( void );
static void Ble_Hci_Gap_Gatt_Init(void);
static const uint8_t* BleGetBdAddress( void );
static void Adv_Request( APP_BLE_ConnStatus_t New_Status );
static void Adv_Cancel( void );
static void HciUserEvtProcess(void *argument);
static void AdvCancelProcess(void *argument);
#ifndef DYNAMIC_MODE
static void Adv_Cancel_Req( void );
#endif
static void Switch_OFF_GPIO( void );
#if(L2CAP_REQUEST_NEW_CONN_PARAM != 0)  
static void ConnIntUpdateReqProcess(void *argument);
static void BLE_SVC_L2CAP_Conn_Update(uint16_t Connection_Handle);
#endif

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
void APP_BLE_Init_Dyn_1( void )
{
/* USER CODE BEGIN APP_BLE_Init_1 */

/* USER CODE END APP_BLE_Init_1 */
  
  SHCI_C2_Ble_Init_Cmd_Packet_t ble_init_cmd_packet =
  {
    {{0,0,0}},                          /**< Header unused */
    {0,                                 /** pBleBufferAddress not used */
    0,                                  /** BleBufferSize not used */
    CFG_BLE_NUM_GATT_ATTRIBUTES,
    CFG_BLE_NUM_GATT_SERVICES,
    CFG_BLE_ATT_VALUE_ARRAY_SIZE,
    CFG_BLE_NUM_LINK,
    CFG_BLE_DATA_LENGTH_EXTENSION,
    CFG_BLE_PREPARE_WRITE_LIST_SIZE,
    CFG_BLE_MBLOCK_COUNT,
    CFG_BLE_MAX_ATT_MTU,
    CFG_BLE_PERIPHERAL_SCA,
    CFG_BLE_CENTRAL_SCA,
    CFG_BLE_LS_SOURCE,
    CFG_BLE_MAX_CONN_EVENT_LENGTH,
    CFG_BLE_HSE_STARTUP_TIME,
    CFG_BLE_VITERBI_MODE,
    CFG_BLE_OPTIONS,
    0,
    CFG_BLE_MAX_COC_INITIATOR_NBR,
    CFG_BLE_MIN_TX_POWER,
    CFG_BLE_MAX_TX_POWER}
  };

  /**
   * Initialize Ble Transport Layer
   */
  Ble_Tl_Init( );

  /**
   * Do not allow standby in the application
   */
  UTIL_LPM_SetOffMode(1 << CFG_LPM_APP_BLE, UTIL_LPM_DISABLE);

  /**
   * Register the hci transport layer to handle BLE User Asynchronous Events
   */
  HciUserEvtProcessId = osThreadNew(HciUserEvtProcess, NULL, &HciUserEvtProcess_attr);

  /**
   * Starts the BLE Stack on CPU2
   */
  SHCI_C2_BLE_Init( &ble_init_cmd_packet );

  /**
   * Initialization of HCI & GATT & GAP layer
   */
  Ble_Hci_Gap_Gatt_Init();

  /**
   * Initialization of the BLE Services
   */
  SVCCTL_Init();

  /**
   * Initialization of the BLE App Context
   */
  BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
  BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0xFFFF;  
  /**
   * From here, all initialization are BLE application specific
   */
  AdvCancelProcessId = osThreadNew(AdvCancelProcess, NULL, &AdvCancelProcess_attr);
   
  /**
   * Initialization of ADV - Ad Manufacturer Element - Support OTA Bit Mask
   */
#if(BLE_CFG_OTA_REBOOT_CHAR != 0)  
    manuf_data[sizeof(manuf_data)-8] = CFG_FEATURE_OTA_REBOOT;
#endif
#if(RADIO_ACTIVITY_EVENT != 0)  
  aci_hal_set_radio_activity_mask(0x0006);
#endif  
  
